[
  { "state": "Initial state. No information collected yet.", "action": "whoami" },
  { "state": "Startup context: unknown user and unknown network.", "action": "whoami" },
  { "state": "Beginning of session. Need identity of current account.", "action": "whoami" },
  { "state": "No user details present. Determine who is running this.", "action": "whoami" },
  { "state": "We have not identified the user account yet.", "action": "whoami" },
  { "state": "Empty context. First step is to identify the current Windows user.", "action": "whoami" },
  { "state": "No account name available in the state.", "action": "whoami" },
  { "state": "Initial: target is local Windows host. User unknown.", "action": "whoami" },
  { "state": "Baseline enumeration: start by obtaining username.", "action": "whoami" },
  { "state": "No identity info. We need the current principal.", "action": "whoami" },
  { "state": "State indicates no previous commands have been executed.", "action": "whoami" },
  { "state": "Session just started. Collect user identity first.", "action": "whoami" },
  { "state": "Nothing known about the system yet. Identify user.", "action": "whoami" },
  { "state": "No output history. Determine the username before proceeding.", "action": "whoami" },
  { "state": "Cold start. Acquire current user context.", "action": "whoami" },
  { "state": "Initial context: no user, no network, no OS details.", "action": "whoami" },
  { "state": "We need to know who we are logged in as.", "action": "whoami" },
  { "state": "No authentication context in state. Retrieve username.", "action": "whoami" },
  { "state": "The state does not include a Windows account string.", "action": "whoami" },
  { "state": "First action should identify the current user account.", "action": "whoami" },
  { "state": "Start-of-demo. Gather basic identity first.", "action": "whoami" },
  { "state": "Initial. Determine current account (e.g., DESKTOP\\\\user).", "action": "whoami" },
  { "state": "No indication of user or domain. Query identity.", "action": "whoami" },
  { "state": "No user has been detected yet.", "action": "whoami" },
  { "state": "Initial state: unknown user context.", "action": "whoami" },

  { "state": "User information detected: DESKTOP\\\\demo-user. Next collect network configuration.", "action": "ipconfig" },
  { "state": "whoami output shows a Windows account. Proceed to network enumeration.", "action": "ipconfig" },
  { "state": "Identified current user. Need IPv4 and interface details now.", "action": "ipconfig" },
  { "state": "User is known (username present). Determine network interfaces.", "action": "ipconfig" },
  { "state": "Account context collected. Next step is to get IP configuration.", "action": "ipconfig" },
  { "state": "Detected user string like DESKTOP\\\\*. Now retrieve network settings.", "action": "ipconfig" },
  { "state": "User identity resolved. Collect adapter and IPv4 address info.", "action": "ipconfig" },
  { "state": "User has been identified. We still lack network information.", "action": "ipconfig" },
  { "state": "State contains username. Next should be ipconfig output.", "action": "ipconfig" },
  { "state": "Current principal obtained. Enumerate network configuration (IPv4, gateway).", "action": "ipconfig" },
  { "state": "We have the running user. Proceed with network configuration discovery.", "action": "ipconfig" },
  { "state": "Identity step complete. Need networking details.", "action": "ipconfig" },
  { "state": "User detected; now determine IP, mask, gateway.", "action": "ipconfig" },
  { "state": "Collected whoami. Next gather ip configuration information.", "action": "ipconfig" },
  { "state": "The state includes user identity but no adapter details.", "action": "ipconfig" },
  { "state": "We know the current account. Next, query network interfaces.", "action": "ipconfig" },
  { "state": "User enumeration done. Start network enumeration.", "action": "ipconfig" },
  { "state": "User context exists. Need to identify IPv4 Address and DNS suffix.", "action": "ipconfig" },
  { "state": "Detected username; proceed to ipconfig to capture network info.", "action": "ipconfig" },
  { "state": "whoami indicates a local account. Get ipconfig next.", "action": "ipconfig" },
  { "state": "User step finished. Now check IP configuration for adapters.", "action": "ipconfig" },
  { "state": "User is known; collect network configuration for subsequent steps.", "action": "ipconfig" },
  { "state": "Identity acquired; need network properties (IPv4 Address).", "action": "ipconfig" },
  { "state": "State: user present, network unknown. Run ipconfig.", "action": "ipconfig" },
  { "state": "We have username but no IP data; enumerate network.", "action": "ipconfig" },

  { "state": "Network configuration detected: IPv4 Address present. Next collect system details.", "action": "systeminfo" },
  { "state": "ipconfig output includes IPv4 Address and adapter info. Proceed to systeminfo.", "action": "systeminfo" },
  { "state": "Network interfaces enumerated. Now retrieve OS and hardware details.", "action": "systeminfo" },
  { "state": "State contains network configuration (IPv4). Next step is system identification.", "action": "systeminfo" },
  { "state": "Detected network details: IPv4 Address, Subnet Mask. Collect system information.", "action": "systeminfo" },
  { "state": "Networking step complete. Gather OS Name and system configuration.", "action": "systeminfo" },
  { "state": "We have IP configuration. Next is systeminfo for OS and build.", "action": "systeminfo" },
  { "state": "Network info available (gateway/DNS). Now collect OS details.", "action": "systeminfo" },
  { "state": "Found adapter settings and IPv4 Address. Move to systeminfo.", "action": "systeminfo" },
  { "state": "Network configuration present; enumerate system properties (OS Name, System Type).", "action": "systeminfo" },
  { "state": "ipconfig indicates active interface and IP. Retrieve Windows version info.", "action": "systeminfo" },
  { "state": "State mentions IPv4 Address. Next: systeminfo to gather OS details.", "action": "systeminfo" },
  { "state": "Network config collected. Determine OS name and system model.", "action": "systeminfo" },
  { "state": "We have network details; proceed to systeminfo to capture host summary.", "action": "systeminfo" },
  { "state": "IPv4 Address detected. Next step: systeminfo for OS and hotfixes.", "action": "systeminfo" },
  { "state": "Adapter and network stack info obtained. Now run systeminfo.", "action": "systeminfo" },
  { "state": "Network step done; need system identification info from systeminfo.", "action": "systeminfo" },
  { "state": "ipconfig results available; continue with systeminfo for OS/host details.", "action": "systeminfo" },
  { "state": "The state includes network configuration. Gather system details next.", "action": "systeminfo" },
  { "state": "Network information retrieved (IPv4 Address). Next is system information.", "action": "systeminfo" },
  { "state": "We have IPv4 and interface data. Now collect OS Name and Version.", "action": "systeminfo" },
  { "state": "Network info present; proceed to systeminfo to complete enumeration.", "action": "systeminfo" },
  { "state": "Detected 'IPv4 Address' in output. Use systeminfo next.", "action": "systeminfo" },
  { "state": "Network enumeration complete. Next gather OS/build details.", "action": "systeminfo" },
  { "state": "State includes adapter configuration; systeminfo should follow.", "action": "systeminfo" },

  { "state": "System information detected: OS Name present. Enumeration can stop.", "action": "STOP" },
  { "state": "systeminfo output contains OS Name and System Type. No further steps needed.", "action": "STOP" },
  { "state": "Collected OS details and hardware summary. Stop the agent.", "action": "STOP" },
  { "state": "State includes OS Name, Version, and Host Name. Conclude demo.", "action": "STOP" },
  { "state": "System details present (OS Name). Terminate cleanly.", "action": "STOP" },
  { "state": "Enumeration complete: user, network, and system info obtained.", "action": "STOP" },
  { "state": "All basic information collected. Stop now.", "action": "STOP" },
  { "state": "Systeminfo retrieved successfully; ending run.", "action": "STOP" },
  { "state": "OS identification complete and no new information required.", "action": "STOP" },
  { "state": "State shows system information has been gathered; stop.", "action": "STOP" },

  { "state": "User detected: DESKTOP\\\\demo-user. Network configuration detected: IPv4 Address present. Proceed to system details.", "action": "systeminfo" },
  { "state": "User and network are already present (username + IPv4). Next gather OS information.", "action": "systeminfo" },
  { "state": "State includes DESKTOP\\\\* and IPv4 Address. Continue with systeminfo.", "action": "systeminfo" },
  { "state": "We already know user identity and network info. Obtain systeminfo to finish.", "action": "systeminfo" },
  { "state": "Identity + networking completed. Collect system details now.", "action": "systeminfo" },

  { "state": "Network configuration present but user identity not clearly stated. Still proceed to system info to complete basic enumeration.", "action": "systeminfo" },
  { "state": "Partial enumeration: network info present. Gather system details next.", "action": "systeminfo" },
  { "state": "Network details exist, need OS info. Run systeminfo.", "action": "systeminfo" },
  { "state": "IPv4 Address detected, proceed to systeminfo for OS Name.", "action": "systeminfo" },
  { "state": "State indicates network configuration is known. Collect system information.", "action": "systeminfo" },

  { "state": "User identity already known but network data missing. Obtain ipconfig.", "action": "ipconfig" },
  { "state": "State contains username but not IPv4 Address. Run ipconfig.", "action": "ipconfig" },
  { "state": "whoami-like information present. Next step is network configuration.", "action": "ipconfig" },
  { "state": "User detected; network configuration absent. Proceed with ipconfig.", "action": "ipconfig" },
  { "state": "Identity known, network unknown. Collect ipconfig output.", "action": "ipconfig" },

  { "state": "User identity is known (whoami already executed). Hostname not collected yet.", "action": "hostname" },
  { "state": "We have current user context. Next, identify the machine name to complete host identity.", "action": "hostname" },
  { "state": "Username detected. Retrieve the computer name to enrich the context.", "action": "hostname" },
  { "state": "User info present. We still need the local host identifier.", "action": "hostname" },
  { "state": "Identity step partially done (user known). Collect hostname now.", "action": "hostname" },
  { "state": "We know who is running the session. Determine hostname before network inspection.", "action": "hostname" },
  { "state": "Account identified. Missing host name.", "action": "hostname" },
  { "state": "User already discovered. Get hostname.", "action": "hostname" },
  { "state": "State includes a Windows account string. Collect hostname next.", "action": "hostname" },
  { "state": "User and privilege context gathered. Need machine name.", "action": "hostname" },

  { "state": "Hostname has been collected. Determine Windows version quickly.", "action": "ver" },
  { "state": "Host identity known. Collect OS version line using ver.", "action": "ver" },
  { "state": "We have hostname but no OS version information yet.", "action": "ver" },
  { "state": "Need a quick Windows version indicator after hostname.", "action": "ver" },
  { "state": "Context includes machine name. Acquire OS version string.", "action": "ver" },
  { "state": "Hostname known. Next step is to get Windows version using ver.", "action": "ver" },
  { "state": "Collect OS version to guide later enumeration steps.", "action": "ver" },
  { "state": "Host identified; OS version is missing.", "action": "ver" },
  { "state": "We know the host name. Retrieve Windows version (ver).", "action": "ver" },
  { "state": "Hostname obtained; verify OS version.", "action": "ver" },

  { "state": "Network configuration is known (ipconfig already run). Next, check ARP cache for local peers.", "action": "arp -a" },
  { "state": "IPv4 address and interface details are present. Inspect ARP table for neighbors.", "action": "arp -a" },
  { "state": "We have network info but no neighbor visibility. Query ARP cache.", "action": "arp -a" },
  { "state": "After ipconfig, collect ARP entries to see recently resolved hosts.", "action": "arp -a" },
  { "state": "Network enumeration ongoing. Check arp table for LAN devices.", "action": "arp -a" },
  { "state": "State indicates network is configured. Get ARP cache.", "action": "arp -a" },
  { "state": "IPv4 Address detected. Now inspect ARP entries.", "action": "arp -a" },
  { "state": "Network config gathered. Determine ARP neighbors.", "action": "arp -a" },
  { "state": "Need local neighbor information; run arp -a.", "action": "arp -a" },
  { "state": "Following ipconfig results, extract neighbor cache via arp -a.", "action": "arp -a" },

  { "state": "Network configuration detected. Next, inspect routing table.", "action": "route print" },
  { "state": "We have IPv4 and gateway context. Retrieve routes using route print.", "action": "route print" },
  { "state": "Need to understand default route and interface routing decisions.", "action": "route print" },
  { "state": "After collecting IP configuration, check routing table for default gateway and networks.", "action": "route print" },
  { "state": "Network context present. Determine routing entries.", "action": "route print" },
  { "state": "ipconfig done; proceed to route print to capture route information.", "action": "route print" },
  { "state": "Network interfaces known. Inspect routes.", "action": "route print" },
  { "state": "IPv4 info present. Check route print next.", "action": "route print" },
  { "state": "Need routing table snapshot for baseline.", "action": "route print" },
  { "state": "Network enumeration: confirm default route via route print.", "action": "route print" },

  { "state": "Network information present. Next, list active connections and listening ports.", "action": "netstat -ano" },
  { "state": "We have basic network config. Check open ports and connections via netstat -ano.", "action": "netstat -ano" },
  { "state": "Need visibility of listening services and established sessions. Run netstat -ano.", "action": "netstat -ano" },
  { "state": "After routes and ARP, enumerate active sockets and PIDs.", "action": "netstat -ano" },
  { "state": "Network baseline done. Now inspect listening ports with netstat -ano.", "action": "netstat -ano" },
  { "state": "We want to identify local services by port and PID.", "action": "netstat -ano" },
  { "state": "Check current TCP/UDP endpoints and owning process IDs.", "action": "netstat -ano" },
  { "state": "Need to capture network activity and listening state.", "action": "netstat -ano" },
  { "state": "Inspect network connections to decide whether to look at running processes.", "action": "netstat -ano" },
  { "state": "Network enumeration: list connections and listeners.", "action": "netstat -ano" },

  { "state": "We have network/socket information (netstat output). Next, list running processes.", "action": "tasklist" },
  { "state": "Ports and PIDs observed. Retrieve process list with tasklist.", "action": "tasklist" },
  { "state": "Need process visibility to correlate PIDs seen in netstat.", "action": "tasklist" },
  { "state": "After netstat -ano, enumerate processes to understand what is running.", "action": "tasklist" },
  { "state": "Connections and listeners detected. Proceed to tasklist for process names.", "action": "tasklist" },
  { "state": "System baseline includes network activity. Next step: tasklist.", "action": "tasklist" },
  { "state": "Need current process snapshot for baseline analysis.", "action": "tasklist" },
  { "state": "We want to map services/ports to running processes; run tasklist.", "action": "tasklist" },
  { "state": "Process enumeration required after seeing open connections.", "action": "tasklist" },
  { "state": "After collecting netstat details, list processes.", "action": "tasklist" }
]
